updated architecture docs
